# IsCallout Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsCallout Property
View Class See Also
---
Indicates if the view is a callout view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsCallout { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsCallout As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsCallout {
	bool get ();
}
```

# Remarks
Reference callouts are not treated as callout views. The view was created as a callout in its parent view but it may show as a section in orthogonal views.
# See Also
View Class
Autodesk.Revit.DB Namespace